tutorials/electrochemistry/NTGKTwoCells/constant/cell2/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Everything in mm
convertToMeters 0.001;

// Depth of battery and tabs (in 2d depth of one cell)
dZcell1 6.858;
dZcells 16.858;
dZcell2 23.716;

// The whole width of the battery cell is 2*dCellOutX2
// and the whole width of each tab is dTabsOutX2 - dTabsInX2:
// Half the distance between inside of the tabs
dTabsInX1  -20;
dTabsInX2   20;
// Half the distance between outside of the tabs
dTabsOutX1 -50;
dTabsOutX2  50;
// Half the distance between outside of the battery cell
dCellOutX1 -62.5;
dCellOutX2  62.5;

// Height of the battery cell
hCellY 195;

vertices
(

    // Cell middle
    ($dTabsInX1   0       $dZcells)        //0
    ($dTabsInX2   0       $dZcells)        //1
    ($dTabsInX2   $hCellY $dZcells)        //2
    ($dTabsInX1   $hCellY $dZcells)        //3

    ($dTabsInX1   0       $dZcell2)      //4
    ($dTabsInX2   0       $dZcell2)      //5
    ($dTabsInX2   $hCellY $dZcell2)      //6
    ($dTabsInX1   $hCellY $dZcell2)      //7

    // Cell positive left tab
    ($dTabsOutX1  0       $dZcells)        //8
    ($dTabsOutX1  $hCellY $dZcells)        //9
    ($dTabsOutX1  0       $dZcell2)      //10
    ($dTabsOutX1  $hCellY $dZcell2)      //11

    // Cell left out
    ($dCellOutX1  0       $dZcells)        //12
    ($dCellOutX1  $hCellY $dZcells)        //13
    ($dCellOutX1  0       $dZcell2)      //14
    ($dCellOutX1  $hCellY $dZcell2)      //15

    // Cell negative right tab
    ($dTabsOutX2  0       $dZcells)        //16
    ($dTabsOutX2  $hCellY $dZcells)        //17
    ($dTabsOutX2  0       $dZcell2)      //18
    ($dTabsOutX2  $hCellY $dZcell2)      //19

    // Cell right out
    ($dCellOutX2  0       $dZcells)        //20
    ($dCellOutX2  $hCellY $dZcells)        //21
    ($dCellOutX2  0       $dZcell2)      //22
    ($dCellOutX2  $hCellY $dZcell2)      //23



);


blocks
(
    // Cell middle
    hex (0 1 2 3 4 5 6 7) (40 195 7) simpleGrading (1 1 1)  //coarser
    //hex (0 1 2 3 4 5 6 7) (80 390 14) simpleGrading (1 1 1)  //finer

    // Cell positive left tab
    hex (8 0 3 9 10 4 7 11) (30 195 7) simpleGrading (1 1 1)  //coarser
    //hex (8 0 3 9 10 4 7 11) (60 390 14) simpleGrading (1 1 1)  //finer

    // Cell left out
    hex (12 8 9 13 14 10 11 15) (10 195 7) simpleGrading (1 1 1)  //coarser
    //hex (12 8 9 13 14 10 11 15) (20 390 14) simpleGrading (1 1 1)  //finer

    // Cell negative right tab
    hex (1 16 17 2 5 18 19 6) (30 195 7) simpleGrading (1 1 1)  //coarser
    //hex (1 16 17 2 5 18 19 6) (60 390 14) simpleGrading (1 1 1)  //finer

    // Cell right out
    hex (16 20 21 17 18 22 23 19) (10 195 7) simpleGrading (1 1 1)  //coarser
    //hex (16 20 21 17 18 22 23 19) (20 390 14) simpleGrading (1 1 1)  //finer
);


boundary
(

    /*left
    {
        type patch;
        faces
        (
            (14 15 13 12)
        );
    }

    right
    {
        type patch;
        faces
        (
            (20 21 23 22)
        );
    }

    top
    {
        type patch;
        faces
        (
            (7 6 2 3)
            (15 11 9 13)
            (19 23 21 17)
        );
    }*/

    toPosTab
    {
        type patch;
        faces
        (
            (11 7 3 9)
        );
    }

    toNegTab
    {
        type patch;
        faces
        (
            (6 19 17 2)
        );
    }

    bottom
    {
        type patch;
        faces
        (
            (4 0 1 5)
            (10 8 0 4)
            (14 12 8 10)
            (5 1 16 18)
            (18 16 20 22)
        );
    }

    housing
    {
        type patch;
        faces
        (
            //front
            (12 13 9 8)
            (8 9 3 0)
            (0 3 2 1)
            (1 2 17 16)
            (16 17 21 20)

            //back
            (14 10 11 15)
            (10 4 7 11)
            (4 5 6 7)
            (5 18 19 6)
            (18 22 23 19)

            //left
            (14 15 13 12)

            //right
            (20 21 23 22)

            //top
            (7 6 2 3)
            (15 11 9 13)
            (19 23 21 17)
        );

    }

);

// ************************************************************************* //
