tutorials/electrochemistry/NTGKTwoCells/constant/cell1/electrochemicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//- Battery capacity - Dimensions: As
//  1.11 Ah (one cell) -> 20 Ah (18 layer jelly roll)
QBat        QBat [0 0 1 0 0 1 0] 71928;

//- Initial depth of dischrage - Dimensions: -
DOD         DOD [0 0 0 0 0 0 0] 0.0;


//- Thickness of positive electrode - Dimensions m
Dp          Dp [0 1 0 0 0 0 0] 161e-6;

//- Thickness of negative electrode - Dimensions m
Dn          Dn [0 1 0 0 0 0 0] 170e-6;

//- Thickness of electrochemical active region- Dimensions m
Dech        Dech [0 1 0 0 0 0 0] 348e-6;

//- Thickness of jelly roll - Dimensions: m
D           D [0 1 0 0 0 0 0] 381e-6;


//- Reference Temperature at which fitting parameter were
//  evaluated- Dimensions: K
TRef            TRef [0 0 0 1 0 0 0] 298.15;


//- fitting parameter ai for fit Y0 - Dimensions: S/m²
a0          a0 [-1 -4 3 0 0 2 0] 1222.72;

a1          a1 [-1 -4 3 0 0 2 0] -5561.68;

a2          a2 [-1 -4 3 0 0 2 0] 24608.2;

a3          a3 [-1 -4 3 0 0 2 0] -49560.06;

a4          a4 [-1 -4 3 0 0 2 0] 46409.90;

a5          a5 [-1 -4 3 0 0 2 0] -16916.71;


//- fitting parameter bi for fit U0 - Dimensions: V
b0          b0 [1 2 -3 0 0 -1 0] 4.125;

b1          b1 [1 2 -3 0 0 -1 0] -1.149;

b2          b2 [1 2 -3 0 0 -1 0] 0.230;

b3          b3 [1 2 -3 0 0 -1 0] 1.010;

b4          b4 [1 2 -3 0 0 -1 0] -0.413;

b5          b5 [1 2 -3 0 0 -1 0] -0.324;


//- fitting parameter C1 for fit T-dependency of Y - Dimensions: K
C1              C1 [0 0 0 1 0 0 0] 1800;

//- fitting parameter C2 for fit T-dependency of U - Dimensions: V/K
C2              C2 [1 2 -3 -1 0 -1 0] -2e-04;


// ************************************************************************* //
