tutorials/electrochemistry/NTGKTwoCells/constant/cell1/thermalAbuseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          electrochemicalProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//- Initial dimensionless amount of Li-containing meta-stable species in SEI field
//  (Could also be specified as an initial field)
cSEI 0.15;

//- Initial dimensionless amount of Li amount intercalacted within the carbon field
//  (Could also be specified as an initial field)
cNE 0.75;

//- Initial dimensionless amount of Li amount intercalacted within the carbon field
//  (Could also be specified as an initial field)
cELE 1;

//- Initial dimensionless measure of SEI layer thickness field
//  (Could also be specified as an initial field)
tSEI 0.033;

//- Initial degree of conversion field
//  (Could also be specified as an initial field)
alpha 0.04;



//- SEI-decomposition frequency factor
ASEI             ASEI [0 0 -1 0 0 0 0] 1.667E15;

//- negative solvent frequency factor
ANE              ANE [0 0 -1 0 0 0 0] 2.5E13;

//- positive solvent frequency factor
APE              APE [0 0 -1 0 0 0 0] 6.667E13;

//- electrolyte decomposition frequency factor
AELE             AELE [0 0 -1 0 0 0 0] 5.15E25;

//- SEI-decomposition activation energy
EASEI            EASEI [1 2 -2 0 -1 0 0] 1.3508E5;

//- negative solvent activation energy
EANE             EANE [1 2 -2 0 -1 0 0] 13508E5;

//- positive solvent activation energy
EAPE             EAPE [1 2 -2 0 -1 0 0] 1396E5;

//- electrolyte decomposition activation energy
EAELE            EAELE [1 2 -2 0 -1 0 0] 2.74E5;

//- SEI-decomposition reaction order
mSEI             mSEI [0 0 0 0 0 0 0] 1;

//- negative solvent reaction order
mNE              mNE [0 0 0 0 0 0 0] 1;

//- positive solvent reaction order 1
mPE1             mPE1 [0 0 0 0 0 0 0] 1;

//- positive solvent reaction order 2
mPE2             mPE2 [0 0 0 0 0 0 0] 1;

//- electrolyte decomposition reaction order
mELE             mELE [0 0 0 0 0 0 0] 1;

//- SEI-decomposition heat release
HSEI             HSEI [0 2 -2 0 0 0 0] 257000;

//- negative solvent heat release
HNE              HNE [0 2 -2 0 0 0 0] 1714000;

//- positive solvent heat release
HPE              HPE [0 2 -2 0 0 0 0] 314000;

//- electrolyte decomposition heat release
HELE             HELE [0 2 -2 0 0 0 0] 155000;

//- specific carbon content in jelly roll
WC               WC [1 -3 0 0 0 0 0] 6.104E2;

//- specific positive active content in jelly roll
WP               WP [1 -3 0 0 0 0 0] 1.221E3;

//- specific electrolyte content in jelly roll
WELE             WELE [1 -3 0 0 0 0 0] 4.069E2;

//- initial/reference dimensionless thickness of SEI layer
tSEIRef          tSEIRef [0 0 0 0 0 0 0] 0.033;



// ************************************************************************* //
