tutorials/electrochemistry/NTGKTwoCells/constant/regionInterfaceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      regionInterfaceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

partitionedCoupledPatches
(
    /*cellToNegTab
    {
        interfaceType defaultInterface;

        coupledPatchPair
        (
            (cell1 toNegTab)
            (cell1 toNegTab)
        );

        coupledFields
        (
            faiNeg
            faiPos
        );

        defaultInterfaceCoeffs
        {}
    }

    cellToPosTab
    {
        interfaceType defaultInterface;

        coupledPatchPair
        (
            (cell1 toPosTab)
            (cell1 toPosTab)
        );

        coupledFields
        (
            faiNeg
            faiPos
        );

        defaultInterfaceCoeffs
        {}
    }*/

    cell1ToPosTabAirCell1_toPosTab
    {
        interfaceType defaultInterface;

        coupledPatchPair
        (
            (cell1 toPosTab)
            (air cell1_toPosTab)
        );

        coupledFields
        (
            T
            faiPos
            faiNeg
        );

        defaultInterfaceCoeffs
        {
            // Jump coefficient
            //K               K [ 0 0 0 0 0 0 0 ] 1;
        }
    }

    cell1ToNegTabAirCell1_toNegTab
    {
        interfaceType defaultInterface;

        coupledPatchPair
        (
            (cell1 toNegTab)
            (air cell1_toNegTab)
        );

        coupledFields
        (
            T
            faiPos
            faiNeg
        );

        defaultInterfaceCoeffs
        {
            // Jump coefficient
            //K               K [ 0 0 0 0 0 0 0 ] 1;
        }
    }

    cell1HousingAirCell1_housing
    {
        interfaceType heatTransferInterface;

        coupledPatchPair
        (
            (cell1 housing)
            (air cell1_housing)
        );

        coupledFields
        (
            T
        );

        heatTransferInterfaceCoeffs
        {
            // Jump coefficient
            K               K [ 0 0 0 0 0 0 0 ] 1;
        }
    }

    cell2ToPosTabAirCell2_toPosTab
    {
        interfaceType defaultInterface;

        coupledPatchPair
        (
            (cell2 toPosTab)
            (air cell2_toPosTab)
        );

        coupledFields
        (
            T
            faiPos
            faiNeg
        );

        defaultInterfaceCoeffs
        {
            // Jump coefficient
            //K               K [ 0 0 0 0 0 0 0 ] 1;
        }
    }

    cell2ToNegTabAirCell2_toNegTab
    {
        interfaceType defaultInterface;

        coupledPatchPair
        (
            (cell2 toNegTab)
            (air cell2_toNegTab)
        );

        coupledFields
        (
            T
            faiPos
            faiNeg
        );

        defaultInterfaceCoeffs
        {
            // Jump coefficient
            //K               K [ 0 0 0 0 0 0 0 ] 1;
        }
    }

    cell2HousingAirCell2_housing
    {
        interfaceType heatTransferInterface;

        coupledPatchPair
        (
            (cell2 housing)
            (air cell2_housing)
        );

        coupledFields
        (
            T
        );

        heatTransferInterfaceCoeffs
        {
            // Jump coefficient
            K               K [ 0 0 0 0 0 0 0 ] 1;
        }
    }
);

monolithicCoupledPatches
();

curvatureCorrectedSurfacePatches 0();

interpolatorUpdateFrequency 0;

interfaceTransferMethod GGI;

directMapCoeffs
{}

GGICoeffs
{}

// ************************************************************************* //
