tutorials/electrochemistry/NTGKTwoCells/0/air/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/InnerFluid";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    airbulk
    {
        type              zeroGradient;
        //type            fixedValue;
        //value           $internalField;
    }

    ground 
    {
        type            zeroGradient;
    }

    "cell1_.*"
    {
        type            zeroGradient;
    }

    "cell2_.*"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
